src/InformationRegisters/ПодписиДокументовКЭДО/ПодписиДокументовКЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПодписиДокументовКЭДО</name>
  <resources>
    <name>Отпечаток</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>28</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаПодписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатСогласования</name>
    <type>
      <types>EnumRef.РезультатыСогласованияБЗК</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.ДокументКадровогоЭДО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЭлектронныеПодписи/ЭлектронныеПодписи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭлектронныеПодписи</name>
  <resources>
    <name>ТребуетсяПроверка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТипПодписи</name>
    <type>
      <types>EnumRef.ТипыПодписиКриптографии</types>
    </type>
  </resources>
  <resources>
    <name>СрокДействияПоследнейМеткиВремени</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПроверкиПодписи</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ИмяФайлаПодписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>260</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>КомуВыданСертификат</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Отпечаток</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>28</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Подпись</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ПодписьВерна</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Сертификат</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПодписи</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>УстановившийПодпись</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <attributes>
    <name>ОшибкаПриАвтоматическомПродлении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПропуститьПриПродлении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПодписи</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьМатематическиВерна</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкаМатематическойПроверкиПодписи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкаПроверкиДополнительныхАтрибутов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеАтрибутыПровереныВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторРучнойПроверкиДополнительныхАтрибутов</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбоснованиеРучнойПроверкиДополнительныхАтрибутов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПодписанныйОбъект</name>
    <type>
      <types>DefinedType.ПодписанныйОбъект</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ПодписиДокументовКЭДО/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПодписиДокументовКЭДО.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ПодписиДокументовКЭДО.Отпечаток КАК Отпечаток
		|ИЗ
		|	РегистрСведений.ПодписиДокументовКЭДО КАК ПодписиДокументовКЭДО
		|ГДЕ
		|	ПодписиДокументовКЭДО.Объект = &Объект
		|	И ПодписиДокументовКЭДО.ФизическоеЛицо = &ФизическоеЛицо
		|	И ПодписиДокументовКЭДО.Отпечаток <> """"";
	Запрос.УстановитьПараметр("Объект", Отбор.Объект.Значение);
	Если Отбор.ФизическоеЛицо.Использование Тогда
		Запрос.УстановитьПараметр("ФизическоеЛицо", Отбор.ФизическоеЛицо.Значение);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПодписиДокументовКЭДО.ФизическоеЛицо = &ФизическоеЛицо", "(ИСТИНА)");
	КонецЕсли;
	ПодписиОбъекта = Запрос.Выполнить().Выгрузить();
	Если ЗначениеЗаполнено(ПодписиОбъекта) Тогда
		ДополнительныеСвойства.Вставить("ПрежниеПодписи", ПодписиОбъекта);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ПрежниеПодписи") Тогда
		ЭлектронныйДокумент = Неопределено;
		ПрежниеПодписи = ДополнительныеСвойства.ПрежниеПодписи;
		Для Каждого Запись Из ЭтотОбъект Цикл
			ДанныеПодписи = ПрежниеПодписи.Найти(Запись.ФизическоеЛицо, "ФизическоеЛицо");
			Если ДанныеПодписи <> Неопределено Тогда
				Если ДанныеПодписи.Отпечаток = Запись.Отпечаток Тогда
					Продолжить;
				КонецЕсли;
				Если ЭлектронныйДокумент = Неопределено Тогда
					ЭлектронныйДокумент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
						Отбор.Объект.Значение, "ЭлектронныйДокумент");
				КонецЕсли;
				Запрос = Новый Запрос;
				Запрос.УстановитьПараметр("ЭлектронныйДокумент", ЭлектронныйДокумент);
				Запрос.УстановитьПараметр("Отпечаток", ДанныеПодписи.Отпечаток);
				Запрос.Текст =
					"ВЫБРАТЬ
					|	ЭлектронныеПодписи.ПорядковыйНомер КАК ПорядковыйНомер
					|ИЗ
					|	РегистрСведений.ЭлектронныеПодписи КАК ЭлектронныеПодписи
					|ГДЕ
					|	ЭлектронныеПодписи.ПодписанныйОбъект = &ЭлектронныйДокумент
					|	И ЭлектронныеПодписи.Отпечаток = &Отпечаток";
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					НаборЗаписей = РегистрыСведений.ЭлектронныеПодписи.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.ПодписанныйОбъект.Установить(ЭлектронныйДокумент);
					НаборЗаписей.Отбор.ПорядковыйНомер.Установить(Выборка.ПорядковыйНомер);
					НаборЗаписей.Записать();
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
